W4D5/MusicAppTesting HW/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "GZpSBH1R__VRJCXq2Gx1GA"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!