W4D5/MusicAppTesting HW/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "ddddd@gmailc.om"], ["password_digest", "$2a$10$m27k4wvC2gnIvbLOWNFRoONhQEFESvVfjneEoElLIYVivQRz/C14."], ["session_token", "Kjvh6fe-tLjrNLcolIewGQ"]]
---
  def create
    @user = User.new(user_params)

    if @user.save